# DeleteLinkSymbolPrompt Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..DeleteLinkSymbolPrompt Property
BuiltInFailures..::..LinkFailures Class See Also
---
All instances of Linked Model '[Name]' have been deleted, but the file itself is still loaded. Remove the Linked File using Manage Links dialog to save memory unless you are going to reuse it in this project. Removing the Link cannot be undone.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DeleteLinkSymbolPrompt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeleteLinkSymbolPrompt As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DeleteLinkSymbolPrompt {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace